"""
          字符串     列表      元组      集合      字典
有序性      有序      有序      有序      有序     有序
重复元素    允许      允许      允许     不允许   key不允许
可变性     不可变     可变     不可变     可变     可变
索引访问    支持      支持      支持     不支持   不支持
切片操作    支持      支持      支持     不支持   不支持
"""
"""
字符串     文本处理           str = "  "
列表      有序可重复数据集合      list = [1, 2, 3, 4]
元组      固定数据记录      tuple = (1, 2, 3)
集合      去重数据集合          set = {1, 2, 3}
字典      键值对             dict = {"first":1, "second":2, "third":3}
"""
"""

"""